# [Datenverarbeitung] Einträge verwalten

In [1]:
import pandas as pd

In [45]:
# Umsatz, Marktkapitalisierung, Ergebnis
tech = pd.DataFrame({'AAPL': [395, 2390, 100], 
                   'GOOG': [280, 1240, 60], 
                  'AMZ' : [514, 960, 14]}, 
                   index = ["umsatz", "marktkapitalisierung", "ergebnis"])

In [46]:
tech

                      AAPL  GOOG  AMZ
umsatz                 395   280  514
marktkapitalisierung  2390  1240  960
ergebnis               100    60   14

## insert()-Funktion

In [47]:
tech.insert(1, "MSFT", [199, 1960, 73])

In [48]:
tech.insert(1, "MSFT", [199, 1960, 73], allow_duplicates= True)

In [19]:
tech

                      AAPL  MSFT  MSFT  GOOG  AMZ
umsatz                 395   199   199   280  514
marktkapitalisierung  2390  1960  1960  1240  960
ergebnis               100    73    73    60   14

### Ersetzungen durchführen

In [27]:
tech

                      AAPL  MSFT  MSFT  GOOG  AMZ
umsatz                 395   199   199   280  514
marktkapitalisierung  2390  1960  1960  1240  960
ergebnis               100    73    73    60   14

In [26]:
# tech.rename(columns = {tech.columns[1] : "MSFT2"})

In [30]:
tech.transpose().rename(index = {"MSFT" : "MSFT2"})

       umsatz  marktkapitalisierung  ergebnis
AAPL      395                  2390       100
MSFT2     199                  1960        73
MSFT2     199                  1960        73
GOOG      280                  1240        60
AMZ       514                   960        14

In [35]:
tech.columns = ["AAPL", "MSFT", "MSFT2", "GOOG", "AMZ"]

In [36]:
tech

                      AAPL  MSFT  MSFT2  GOOG  AMZ
umsatz                 395   199    199   280  514
marktkapitalisierung  2390  1960   1960  1240  960
ergebnis               100    73     73    60   14

In [37]:
tech["IBM"] = [61, 105, 8]

In [38]:
tech

                      AAPL  MSFT  MSFT2  GOOG  AMZ  IBM
umsatz                 395   199    199   280  514   61
marktkapitalisierung  2390  1960   1960  1240  960  105
ergebnis               100    73     73    60   14    8

In [39]:
tech.MSFT2 = tech.IBM

### Spalte entfernen

In [40]:
tech

                      AAPL  MSFT  MSFT2  GOOG  AMZ  IBM
umsatz                 395   199     61   280  514   61
marktkapitalisierung  2390  1960    105  1240  960  105
ergebnis               100    73      8    60   14    8

In [41]:
del tech["IBM"]

In [42]:
tech

                      AAPL  MSFT  MSFT2  GOOG  AMZ
umsatz                 395   199     61   280  514
marktkapitalisierung  2390  1960    105  1240  960
ergebnis               100    73      8    60   14

In [43]:
tech.columns = ["AAPL", "MSFT", "IBM", "GOOG", "AMZ"]

In [44]:
tech

                      AAPL  MSFT  IBM  GOOG  AMZ
umsatz                 395   199   61   280  514
marktkapitalisierung  2390  1960  105  1240  960
ergebnis               100    73    8    60   14

### Alternative: replace()-Funktion

In [49]:
tech

                      AAPL  MSFT  MSFT  GOOG  AMZ
umsatz                 395   199   199   280  514
marktkapitalisierung  2390  1960  1960  1240  960
ergebnis               100    73    73    60   14

In [50]:
tech.columns = ["AAPL", "MSFT", "MSFT2", "GOOG", "AMZ"]

In [51]:
tech

                      AAPL  MSFT  MSFT2  GOOG  AMZ
umsatz                 395   199    199   280  514
marktkapitalisierung  2390  1960   1960  1240  960
ergebnis               100    73     73    60   14

In [53]:
tech["IBM"] = [61, 105, 8]

In [54]:
tech["MSFT2"] = tech.IBM.replace([199, 1960, 73], [61, 105, 8])

In [55]:
tech

                      AAPL  MSFT  MSFT2  GOOG  AMZ  IBM
umsatz                 395   199     61   280  514   61
marktkapitalisierung  2390  1960    105  1240  960  105
ergebnis               100    73      8    60   14    8

In [56]:
del tech["IBM"]

In [57]:
tech.columns = ["AAPL", "MSFT", "IBM", "GOOG", "AMZ"]

In [58]:
tech

                      AAPL  MSFT  IBM  GOOG  AMZ
umsatz                 395   199   61   280  514
marktkapitalisierung  2390  1960  105  1240  960
ergebnis               100    73    8    60   14